app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(schoolclass_params(:title, :room_number))
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(schoolclass_params(:title))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["id", 1]]