app/controllers/students_controller.rb

  def update
    @student = Student.find(params[:id])
    @student.update(student_params(:first_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["updated_at", "2019-02-27 17:04:05.283650"], ["id", 1]]